Revit 2027 API
Parameter.Set(String) Method
Sets the parameter to a new string of text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Set(
	string value
)
Public Function Set (
	value As String
) As Boolean
public:
bool Set(
	String^ value
)
member Set :
        value : string -> bool
Parameters
value String
The new text value to which the parameter is to be set.
Return Value
Boolean
The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Exceptions
Exception | Condition
InvalidOperationException | The parameter is read-only.
Remarks
You should only use this method if the StorageType property reports the type of the parameter as a String.
Example
void AddInstanceComment(Wall wall)
{
    // Get the comment parameter of the element instance
    Parameter commentPara = wall.get_Parameter(BuiltInParameter.ALL_MODEL_INSTANCE_COMMENTS);
    if (null != commentPara)
    {
        // Add a greeting string to the comment
        commentPara.Set("Hello Everyone.");
    }
}
See Also
Reference
Parameter Class
Set Overload
Autodesk.Revit.DB Namespace